luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSent_bf.h
/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.SCRI */
#define IFX_SENT_CH_INTEN_SCRI_OFF (12u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.SDI */
#define IFX_SENT_CH_INTEN_SDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.SDI */
#define IFX_SENT_CH_INTEN_SDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.SDI */
#define IFX_SENT_CH_INTEN_SDI_OFF (11u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.TBI */
#define IFX_SENT_CH_INTEN_TBI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.TBI */
#define IFX_SENT_CH_INTEN_TBI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.TBI */
#define IFX_SENT_CH_INTEN_TBI_OFF (4u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.TDI */
#define IFX_SENT_CH_INTEN_TDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.TDI */
#define IFX_SENT_CH_INTEN_TDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.TDI */
#define IFX_SENT_CH_INTEN_TDI_OFF (3u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.WDI */
#define IFX_SENT_CH_INTEN_WDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.WDI */
#define IFX_SENT_CH_INTEN_WDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.WDI */
#define IFX_SENT_CH_INTEN_WDI_OFF (13u)

/** \brief  Length for Ifx_SENT_CH_INTEN_Bits.WSI */
#define IFX_SENT_CH_INTEN_WSI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTEN_Bits.WSI */
#define IFX_SENT_CH_INTEN_WSI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTEN_Bits.WSI */
#define IFX_SENT_CH_INTEN_WSI_OFF (10u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.CRCI */
#define IFX_SENT_CH_INTSET_CRCI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.CRCI */
#define IFX_SENT_CH_INTSET_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.CRCI */
#define IFX_SENT_CH_INTSET_CRCI_OFF (9u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.FDI */
#define IFX_SENT_CH_INTSET_FDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.FDI */
#define IFX_SENT_CH_INTSET_FDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.FDI */
#define IFX_SENT_CH_INTSET_FDI_OFF (6u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.FRI */
#define IFX_SENT_CH_INTSET_FRI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.FRI */
#define IFX_SENT_CH_INTSET_FRI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.FRI */
#define IFX_SENT_CH_INTSET_FRI_OFF (5u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.NNI */
#define IFX_SENT_CH_INTSET_NNI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.NNI */
#define IFX_SENT_CH_INTSET_NNI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.NNI */
#define IFX_SENT_CH_INTSET_NNI_OFF (7u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.NVI */
#define IFX_SENT_CH_INTSET_NVI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.NVI */
#define IFX_SENT_CH_INTSET_NVI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.NVI */
#define IFX_SENT_CH_INTSET_NVI_OFF (8u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.RBI */
#define IFX_SENT_CH_INTSET_RBI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.RBI */
#define IFX_SENT_CH_INTSET_RBI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.RBI */
#define IFX_SENT_CH_INTSET_RBI_OFF (2u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.RDI */
#define IFX_SENT_CH_INTSET_RDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.RDI */
#define IFX_SENT_CH_INTSET_RDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.RDI */
#define IFX_SENT_CH_INTSET_RDI_OFF (1u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.RSI */
#define IFX_SENT_CH_INTSET_RSI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.RSI */
#define IFX_SENT_CH_INTSET_RSI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.RSI */
#define IFX_SENT_CH_INTSET_RSI_OFF (0u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.SCRI */
#define IFX_SENT_CH_INTSET_SCRI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.SCRI */
#define IFX_SENT_CH_INTSET_SCRI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.SCRI */
#define IFX_SENT_CH_INTSET_SCRI_OFF (12u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.SDI */
#define IFX_SENT_CH_INTSET_SDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.SDI */
#define IFX_SENT_CH_INTSET_SDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.SDI */
#define IFX_SENT_CH_INTSET_SDI_OFF (11u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.TBI */
#define IFX_SENT_CH_INTSET_TBI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.TBI */
#define IFX_SENT_CH_INTSET_TBI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.TBI */
#define IFX_SENT_CH_INTSET_TBI_OFF (4u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.TDI */
#define IFX_SENT_CH_INTSET_TDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.TDI */
#define IFX_SENT_CH_INTSET_TDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.TDI */
#define IFX_SENT_CH_INTSET_TDI_OFF (3u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.WDI */
#define IFX_SENT_CH_INTSET_WDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.WDI */
#define IFX_SENT_CH_INTSET_WDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.WDI */
#define IFX_SENT_CH_INTSET_WDI_OFF (13u)

/** \brief  Length for Ifx_SENT_CH_INTSET_Bits.WSI */
#define IFX_SENT_CH_INTSET_WSI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSET_Bits.WSI */
#define IFX_SENT_CH_INTSET_WSI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSET_Bits.WSI */
#define IFX_SENT_CH_INTSET_WSI_OFF (10u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.CRCI */
#define IFX_SENT_CH_INTSTAT_CRCI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.CRCI */
#define IFX_SENT_CH_INTSTAT_CRCI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.CRCI */
#define IFX_SENT_CH_INTSTAT_CRCI_OFF (9u)

/** \brief  Length for Ifx_SENT_CH_INTSTAT_Bits.FDI */
#define IFX_SENT_CH_INTSTAT_FDI_LEN (1u)

/** \brief  Mask for Ifx_SENT_CH_INTSTAT_Bits.FDI */
#define IFX_SENT_CH_INTSTAT_FDI_MSK (0x1u)

/** \brief  Offset for Ifx_SENT_CH_INTSTAT_Bits.FDI */
#define IFX_SENT_CH_INTSTAT_FDI_OFF (6u)

